
## Plan Result

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/15750237067)


<pre><code>Plan: 0 to add, 18 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_zero_trust_access_application.applications[&#34;alloy-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;cadvisor-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;esphome-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;gate&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;gate-peterovi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;grafana-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;hass-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;kodi-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;msr-2&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;prometheus-rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;rpi&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;transmission&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;uzg-01&#34;]
  * cloudflare_zero_trust_access_application.applications[&#34;zigbee2mqtt-rpi&#34;]
  * cloudflare_zero_trust_access_identity_provider.google_oauth
  * cloudflare_zero_trust_access_policy.allow_all
  * cloudflare_zero_trust_access_policy.google_sso_access
  * cloudflare_zero_trust_access_policy.uptimerobot_direct_access


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_zero_trust_access_application.applications["alloy-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "7e1a3cf4f1feaa930fb710ff036083a7a370c0e802abb603f2ad92aeb159012b" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:30Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "alloy-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "f1ce7728-8f01-4b03-9e07-25d4c4383d6f"
      + landing_page_design          = (known after apply)
        name                         = "alloy-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "alloy-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["cadvisor-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "80b9dd2bfc3e93fa78c36418f29f47335e97a10e2737dbb21273d5389f1e9009" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "cadvisor-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "d9f86441-7de2-443f-85e1-0790a9d59372"
      + landing_page_design          = (known after apply)
        name                         = "cadvisor-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "cadvisor-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["esphome-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "8cb3fded19c0fa56fcffb057d0eb2fbd3c97249b58dd59b2655029645dceb10e" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "esphome-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "373a3587-41f2-48b1-a3b3-77642261452d"
      + landing_page_design          = (known after apply)
        name                         = "esphome-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "esphome-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "afdb02d1b7bd0efa48b3e8dc37a1f9f58e6972d026e18a9f46030583dbeae49b" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "gate.xvx.cz" -> null
            },
        ] -> null
        id                           = "3136e7d6-6f45-4d3b-8b45-e9ec0fc51aa4"
      + landing_page_design          = (known after apply)
        name                         = "gate"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "gate.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          + "lan",
            "router",
            "wan",
          - "lan",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate-peterovi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "118319956b5912e799bcd3732853e8c884d37fda7ed6c76c54990e270b16ee0f" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "gate-peterovi.xvx.cz" -> null
            },
        ] -> null
        id                           = "9f055b30-d866-4f4d-8193-58dbe7e3c35d"
      + landing_page_design          = (known after apply)
        name                         = "gate-peterovi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "gate-peterovi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          + "lan",
            "router",
            "wan",
          - "lan",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["grafana-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "f057d168ef9f84a34cd08a1e489d43c8a5881e588d6233871d3277dd79c68d10" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:30Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "grafana-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "def0d7ca-69a4-4f4c-b964-fc8718977b72"
      + landing_page_design          = (known after apply)
        name                         = "grafana-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "grafana-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["hass-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "3711c79427fbbe6321f8e00054a839eccfaf5e3da8a802cd809a856aa8a4b1d0" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "hass-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "d092e1e6-d991-47cf-b49f-a7ff9d2c1635"
      + landing_page_design          = (known after apply)
        name                         = "hass-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "d500f04e-d4dd-43b3-bf27-095e33951016"
              - include    = [
                  - {
                      - everyone = {} -> null
                    },
                ] -> null
              - name       = "Allow All" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "hass-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["kodi-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "a5c36d1f3797330340aa37dedbad8dcddf43b503a93d1f8cd1168fbc2053c1f5" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "kodi-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "5d3c261b-d8db-4111-9eff-e9b47b5050e1"
      + landing_page_design          = (known after apply)
        name                         = "kodi-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "kodi-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["msr-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "9c664e37cf334fad33ee60aaa079c2845081bd3b6e6388b778dcf849baa48e67" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "msr-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "691b1dd6-ec52-4661-9cc0-fee6fb878179"
      + landing_page_design          = (known after apply)
        name                         = "msr-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "msr-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "iot",
            "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["prometheus-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "1ffccdd9f2501869fef4272df0249c40fc0c3d5993d5f02ef0a2cefdd1fd933f" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:30Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "prometheus-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "5a7e1ecf-de54-4478-bb65-d8d543754e80"
      + landing_page_design          = (known after apply)
        name                         = "prometheus-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "prometheus-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "4db21a09f636ce531acbbd95d7240daf695c85802a9605285f1c06990d11b0f3" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:31Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "fd331c0a-615a-4371-ac07-e033d7f4b47f"
      + landing_page_design          = (known after apply)
        name                         = "rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
            "container",
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:12Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["transmission"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "0e757f804830719e31bc56138d2754f95f1ce95220e872368937fcf32a28540d" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "transmission.xvx.cz" -> null
            },
        ] -> null
        id                           = "dd230d90-8470-4e9a-ba23-ea5a569c8179"
      + landing_page_design          = (known after apply)
        name                         = "transmission"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "transmission.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "router",
        ]
      ~ updated_at                   = "2025-06-19T05:26:08Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["uzg-01"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "0675113737df63ed3d4af6bc672816715eb6fc67458fbbec45500d99fd3ce72a" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "uzg-01.xvx.cz" -> null
            },
        ] -> null
        id                           = "17db62a4-3bfd-49f0-bb6c-801a259cfd6c"
      + landing_page_design          = (known after apply)
        name                         = "uzg-01"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "uzg-01.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "iot",
            "lan",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "544fd986c1ccab0693cc8d6925f73697466945380ffb117994a4b70a0727d097" -> (known after apply)
      ~ created_at                   = "2025-06-19T05:07:30Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "zigbee2mqtt-rpi.xvx.cz" -> null
            },
        ] -> null
        id                           = "a5acb80a-2caf-43f8-8f59-4711bdfaa0ad"
      + landing_page_design          = (known after apply)
        name                         = "zigbee2mqtt-rpi"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "ad2a4ab0-b97b-43aa-916b-b7690e92121f" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "zigbee2mqtt-rpi.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "iot",
            "container",
          - "wifi",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-06-19T05:26:07Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "7b1954fa-bbd2-4cf3-9377-1299319b9956"
        name        = "Google IDP"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.allow_all will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "allow_all" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-06-19T05:07:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "d500f04e-d4dd-43b3-bf27-095e33951016"
        name             = "Allow All"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-06-19T05:26:07Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 13 -> (known after apply)
      ~ created_at       = "2025-06-19T05:07:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "9a0319bc-fae3-45ef-b6e9-375a9e8c2d42"
        name             = "Google SSO Access"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-06-19T05:26:07Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 13 -> (known after apply)
      ~ created_at       = "2025-06-19T05:07:02Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "c872ad2e-c80f-486b-b38d-7f2cecf860a6"
        name             = "UptimeRobot Direct Access"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-06-19T05:26:07Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 18 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tofu-cloudflare","PRNumber":210,"Program":"tfcmt","SHA1":"97cc944a9baa68f9dae7cd15b451d1c074ea2749","Vars":{},"WorkflowName":"tofu-cloudflare"} -->